# GetChildrenKeys Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeyBasedTreeEntry..::..GetChildrenKeys Method
KeyBasedTreeEntry Class See Also
---
Gets a collection containing the keys of all children entry objects from this entry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<string> GetChildrenKeys()
```

Visual Basic
---
```text
Public Function GetChildrenKeys As IList(Of String)
```

Visual C++
---
```text
public:
IList<String^>^ GetChildrenKeys()
```

# ### Return Value
The collection containing the keys of all children entry objects from this entry.
# Remarks
To look up the entry object corresponding to the child keys using KeyBasedTreeEntries.FindEntry().
# See Also
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace